{
    "id": "intro",
    "narrative": "#narrative.md",
    "detailedDescriptions": [
        {
            "text": "The ground beneath you is soft and muddy, suggesting recent rain. Your clothes are damp but not soaked.",
            "perception": 0
        },
        {
            "text": "Looking more carefully, you notice faint footprints in the mud leading away from where you lay - someone was here recently.",
            "perception": 5
        },
        {
            "text": "In the dim light, you can make out a small symbol carved into a nearby tree: an ancient rune that seems to pulse with faint energy.",
            "perception": 10
        }
    ],
    "objects": [
        {
            "id": "sword",
            "weight": 1,
            "perception": 1,
            "removable": true,
            "description": "A sharp sword",
            "traits": ["sharp", "sword"],
            "carryEffects": {
                "addEffects": ["strength_boost"]
            },
            "detailedDescriptions": [
                {
                    "text": "The blade is well-maintained, with a silver hilt that shows signs of frequent use.",
                    "perception": 0
                },
                {
                    "text": "Upon closer inspection, you notice an inscription on the bottom of the hilt that reads 'To my son' in elegant script.",
                    "perception": 5,
                    "effects": {
                        "addTraits": ["sentimental"]
                    }
                },
                {
                    "text": "The edge of the blade has a faint blue glow, suggesting it has been enchanted. The enchantment seems to enhance its cutting power.",
                    "perception": 10,
                    "effects": {
                        "stats": {
                            "strength": 1
                        }
                    }
                }
            ]
        },
        {
            "id": "backpack",
            "weight": 1,
            "perception": 0,
            "removable": true,
            "description": "A backpack",
            "traits": ["container"],
            "maxWeight": 10,
            "maxItems": 5,
            "contains": []
        },
        {
            "id": "magical_crystal",
            "weight": 0.5,
            "perception": 2,
            "removable": true,
            "description": "A glowing crystal embedded in a stone pedestal",
            "traits": ["magical", "crystal"],
            "defaultState": "dormant",
            "states": [
                {
                    "id": "dormant",
                    "actionNames": ["activate", "awaken", "touch", "channel"],
                    "effects": {}
                },
                {
                    "id": "active",
                    "actionNames": ["deactivate", "dormant", "rest"],
                    "effects": {
                        "target": {
                            "type": "character",
                            "id": ""
                        },
                        "stats": {
                            "willpower": 2,
                            "perception": 1
                        },
                        "addEffects": ["blessed"]
                    }
                }
            ],
            "proximityEffect": {
                "addEffects": ["enhanced_perception"]
            },
            "detailedDescriptions": [
                {
                    "text": "The crystal is about the size of your fist, with a soft inner light that pulses gently. It's set into a stone pedestal that seems to be part of the ground itself.",
                    "perception": 0
                },
                {
                    "text": "The crystal responds to your presence - the light brightens slightly as you approach, and you can feel a faint warmth radiating from it.",
                    "perception": 3
                },
                {
                    "text": "This is a 'Sanctuary Crystal' - a magical artifact that provides protection and clarity to those nearby. When activated, it creates a small area of safety and enhanced awareness. The crystal seems to recognize you as a friend.",
                    "perception": 7,
                    "effects": {
                        "addFlags": ["crystal_identified"],
                        "addTraits": ["crystal_knowledge"]
                    }
                }
            ]
        }
    ],
    "npcs": [
        {
            "id": "mysterious_wanderer",
            "name": "Mysterious Wanderer",
            "baseStats": {
                "health": 8,
                "willpower": 6,
                "perception": 7,
                "reputation": 0,
                "strength": 5,
                "agility": 6
            },
            "description": "A cloaked figure stands near the edge of the clearing, watching you with keen interest. Their features are partially hidden by shadow, but you can sense an air of ancient wisdom about them.",
            "traits": ["wanderer", "mysterious"],
            "detailedDescriptions": [
                {
                    "text": "The wanderer's cloak is made of a strange material that seems to shift colors in the dim light, suggesting it may be enchanted.",
                    "perception": 3
                },
                {
                    "text": "You notice the wanderer carries a staff with intricate carvings that glow faintly - they are clearly a practitioner of magic.",
                    "perception": 5
                },
                {
                    "text": "The wanderer's eyes, now visible, hold a deep sadness mixed with determination. They have seen much in their travels and bear the weight of many secrets.",
                    "perception": 8
                }
            ],
            "personality": "The Mysterious Wanderer is cautious but not unfriendly. They speak in riddles and half-truths, preferring to let others discover knowledge through their own efforts rather than giving direct answers. They are deeply knowledgeable about the ancient runes and magical artifacts in this area, but they guard their information carefully. The wanderer has a soft spot for those who show genuine curiosity and respect for the mysteries of the world. They can be persuaded to share more if approached with the right questions or if they sense the seeker is worthy.",
            "keyInformation": [
                {
                    "text": "The wanderer knows that the rune carved in the tree is a protection ward, placed here by an ancient order to guard against dark forces.",
                    "perception": 3
                },
                {
                    "text": "They can tell you that the Sanctuary Crystal (the magical crystal in the clearing) was left here by a previous traveler who was seeking refuge from pursuers.",
                    "perception": 4
                },
                {
                    "text": "The wanderer knows about the footprints you noticed - they belong to a group of bandits who passed through recently, heading north toward the crossroads.",
                    "perception": 5
                },
                {
                    "text": "They are aware of a hidden path that leads to an old temple in the forest, but they won't reveal its location unless you prove yourself trustworthy.",
                    "perception": 7
                },
                {
                    "text": "The wanderer knows the true purpose of the Sanctuary Crystal - it was created to protect those who carry the 'sentimental' trait, and it responds more strongly to such individuals.",
                    "perception": 9
                },
                {
                    "text": "They have information about the sword's previous owner - it belonged to a knight who fell defending this very clearing from dark creatures. The inscription 'To my son' was added by the knight's father, a master enchanter.",
                    "perception": 10
                }
            ]
        }
    ],
    "exits": [{
        "direction": "n",
        "nextSceneId": "crossroads",
        "description": "A path to the north",
        "detailedDescriptions": [
            {
                "text": "The path is well-worn, suggesting it's frequently traveled. It leads into the distance where you can see a fork in the road.",
                "perception": 0
            },
            {
                "text": "You notice that the path has been recently maintained - someone has cleared away overhanging branches and filled in potholes.",
                "perception": 5
            }
        ]
    }]
}

